#include "delay.h"

//==========================================================
//	函数名称：	delay_ms()
//
//	函数功能：	毫秒延时函数
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void delay_ms(uint32 nms)
{		
    uint16 i,j;
    
    for (i=0; i<nms; i++)
        for (j=0; j<535; j++);
}

//==========================================================
//	函数名称：	delay_us()
//
//	函数功能：	微秒延时函数
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void delay_us(uint32 nus)
{		
    uint8 i;
    
    for (i=0; i<nus; i++);
}


//==========================================================
//	函数名称：	Hal_Init_Mcu()
//
//	函数功能：	时钟初始化
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
//void Hal_Init_Mcu(void)
//{
//
//  SLEEPCMD &= ~0X04;//将两个高频的晶振同时上电(即同时开启)
//
//
//  while(!(SLEEPSTA & 0x20) || !(SLEEPSTA & 0x40));//等待两个高频晶振都稳定
//  
//  asm("NOP");
//
//  {
//
//    uint16 i;
//
//    for(i=0;i<504;i++)
//
//    asm("NOP");
//  }
//
//  CLKCONCMD = 0X00;
//  SLEEPCMD |= 0X04;
//
//}