#include "stm32f1xx.h"
#include "delay.h"
#include "iwdg.h"
#include "led.h"
#include "key.h"

/**
************************************************************
************************************************************
************************************************************
*
*	作者： 		重庆八城科技
*
*	日期： 		2019-12-31
*
*	版本： 		V1.0
*
*	说明： 		独立看门狗实验-HAL库版本
*
*	修改记录：	
************************************************************
************************************************************
************************************************************
**/

int main(void)
{
	HAL_Init();          //初始化HAL库    
	LED_Init();				   //初始化LED	
	KEY_Init();				   //初始化按键
	IWDG_Init(IWDG_PRESCALER_64,500); //分频数为64,重载值为500,溢出时间为1s	
	HAL_Delay(500);    

	while(1)
	{
			LED_ON();					//四个LED全部保持常亮
			if(KEY_Scan(1)==S1_PRES){  //如果按下按键S1按下，执行喂狗操作
				IWDG_Feed();  	//喂狗
			}
  }
}


