#include "Optocoupler.h"
#include "stm32f1xx.h"
#include "DZD.h"
/**
************************************************************
************************************************************
************************************************************
*
*	作者： 		重庆八城科技
*
*	日期： 		2019-12-11
*
*	版本： 		V2.0
*
*	说明： 		光电开关模块
*
*	修改记录：	
************************************************************
************************************************************
************************************************************
**/
int main(void)
{
	HAL_Init();						//初始化HAL库    
	Optocoupler_Init();		//初始化光电传感器，使能传感器
  DZD_Init();           //初始化底座灯控制IO
  
	while(1)
	{
		if(Optocoupler_State_Read())	//读取光电状态
		{//有数据
       /*底座灯亮红色*/      
        DZD_ColSet(DZD_RED);
		}
		else
		{//无数据
       /*底座灯全熄灭*/
       DZD_ColSet(DZD_BLACKOUT);
		}
	}
}




