#include "stm32f1xx.h"
#include "delay.h"
#include "led.h"
#include "timer.h"
/**
************************************************************
************************************************************
************************************************************
*
*	作者： 		重庆八城科技
*
*	日期： 		2020-03-10
*
*	版本： 		V2.0
*
*	说明： 		定时器实验-HAL库版本
*
*	修改记录：	
************************************************************
************************************************************
************************************************************
**/
extern TIM_HandleTypeDef TIM2_Handler;      	//定时器句柄 
int main(void)
{
	HAL_Init();                  	//初始化HAL库    
	LED_Init();				     				//初始化LED控制接口	  
  /* 系统时钟64MHz 64MHz/6400/10000 = 1HZ*/
	TIM2_Init(10000-1,6400-1);    //定时器2初始化中断周期1秒			
	while(1);
}
//==========================================================
//	函数名称：	TIM2_IRQHandler
//
//	函数功能：	定时器2中断服务函数
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：定时器2中断服务函数，函数的名字不可随意修改。		
//==========================================================
void TIM2_IRQHandler(void)
{
    static uint8_t state = 0;
    state = 1 - state;
    
    if(state){
        LED_ON();//LED灯全亮
    }
    else{
        LED_OFF(); //LED灯全灭   
    }
    
    __HAL_TIM_CLEAR_IT(&TIM2_Handler, TIM_IT_UPDATE);//清中断标志位，必须需要
}



