#include "HC_SR04.h"
#include "delay.h"
#include "Time.h"

unsigned int HCSR04Count = 0;  

//==========================================================
//	函数名称：	Time1_Init()
//
//	函数功能：	初始化定时器1
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void Time1_Init(void)
{
  T1CC0L = 0xA0;        //设置最大计数值的低8位
  T1CC0H = 0x00;        //设置最大计数值的高8位
  T1CCTL0 |= 0x04;      //开启通道0的输出比较模式
  T1IE = 0;             //使能定时器1中断
  T1OVFIM = 1;          //使能定时器1溢出中断
  EA = 1;               //使能总中断
  T1CTL = 0x02;         //分频系数是1,模模式
}

//==========================================================
//	函数名称：	Timer1_Sevice()
//
//	函数功能：	定时器1服务函数
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
#pragma vector = T1_VECTOR
__interrupt void Timer1_Sevice()
{
  T1STAT &= ~0x01;      //清除定时器1通道0中断标志
  HCSR04Count++;  
}

