#include "stm32f1xx_hal.h"
#include "stm32f1xx.h"
#include "HC_SR04.h"
#include "TM1640.h"
#include "Rs485.h"
#include "usart.h"
#include "delay.h"
#include "timer.h"
#include "iwdg.h"

/**
************************************************************
************************************************************
************************************************************
*
*	作者： 		重庆八城科技
*
*	日期： 		2019-12-19
*
*	版本： 		V2.0
*
*	说明： 		超声波模块
*
*	修改记录：	
************************************************************
************************************************************
************************************************************
**/

int main(void)
{
  HAL_Init();             					//初始化HAL库  		
	Rs485_Init();											//初始化485
	TM1640_Init();										//初始化TM1640
	HCSR04_Init();										//初始化超声波模块
	UART1_Init(115200);								//初始化串口一
	IWDG_Init(IWDG_PRESCALER_64,500); //分频数为64,重载值为500,溢出时间为1s	
	TIM2_Init(10-1,64-1);							//初始化定时器2(10us)
	
	while(1)
	{
		//send_LED_Display(0xC0,1111,1);				//数码管显示距离
		IWDG_Feed();  	//喂狗
		HCSR04_StartMeasure(10);				//测距并显示到数码管上（P5A）
	}
}



