#include "stm32f1xx.h"   
#include "delay.h"

//==========================================================
//	函数名称：	__us
//
//	函数功能：	一个单位的微秒延时函数
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================    
void __us(void)
{
    uint8_t usd = 8;
    while(usd)
    {
        usd--;
    }
}

//==========================================================
//	函数名称：	delay_ms
//
//	函数功能：	毫秒延时函数
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void delay_ms(unsigned int nms)
{	
    	
	unsigned int i = 0,j = nms*1000;
	for(i = 0;i<j;i++)
	{
        __us();
	}
}

//==========================================================
//	函数名称：	delay_us
//
//	函数功能：	微秒延时函数
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void delay_us(unsigned int nus)
{		
	unsigned int i;
	for(i=0;i<nus;i++)
	{
        __us();
	}
}



