#include "delay.h"
#include "typedef.h"
//==========================================================
//	函数名称：	delay_ms()
//
//	函数功能：	毫秒延时函数
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void delay_ms(uint32_t nms)
{		
    volatile uint16_t i,j;
    
    for (i=0; i<nms; i++)
        for (j=0; j<535; j++);
}

//==========================================================
//	函数名称：	delay_us()
//
//	函数功能：	微秒延时函数
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void delay_us(uint32_t nus)
{		
    volatile uint8_t i;
    
    for (i=0; i<nus; i++);
}




