#include "stm32f1xx_hal.h"
#include "stm32f1xx.h"
#include "HC_SR04.h"
#include "TM1640.h"
#include "Rs485.h"
#include "usart.h"
#include "delay.h"
#include "timer.h"
#include "iwdg.h"

/**
************************************************************
************************************************************
************************************************************
*
*	作者： 		重庆八城科技
*
*	日期： 		2019-12-19
*
*	版本： 		V2.0
*
*	说明： 		超声波模块
*
*	修改记录：	
************************************************************
************************************************************
************************************************************
**/

int main(void)
{
    uint16_t Avg;        //测量返回的距离值

    HAL_Init();          //初始化HAL库  		
    TM1640_Init();			 //初始化TM1640，数码管驱动
    HCSR04_Init();			 //初始化超声波模块
    TIM2_Init(10-1,64-1);		//初始化定时器2(中断周期10us)，超声波测量使用

    while(1)
    {
          Avg =  HCSR04_StartMeasure(10);	//探测距离共探测10次
          send_LED_Display(0xC0,Avg,1);		//数码管显示距离
          HAL_Delay(500);                 //每500ms测量一次
    }
}



