#include "Switch.h"
#include <ioCC2530.h>
//==========================================================
//	函数名称：	Optocoupler_Init()
//
//	函数功能：	光电传感器初始化
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void Optocoupler_Init(void)
{
    P1SEL &= ~0x01;     //设置P1.0为普通IO口  
    P1DIR &= ~0x01;     //按键接在P1.0口上，设P1.0为输入模式 
    P1INP &= ~0x01;     //打开P1.0上拉电阻

    P1SEL &= ~0x02;     //设置P1.1为普通IO口  
    P1DIR |= 0x02;      //P1.1定义为输出
    Optocoupler_Switch_ON();//开启光电传感器模块
}