#include "stm32f1xx.h"
#include "exti.h"
#include "led.h"
#include "key.h"

/**
************************************************************
************************************************************
************************************************************
*
*	作者： 		重庆八城科技
*
*	日期： 		2020-03-10
*
*	版本： 		V2.0
*
*	说明： 		外部中断函数操作实验-HAL库版本
*
*	修改记录：
************************************************************
************************************************************
************************************************************
**/

int main(void)
{
    HAL_Init();       //初始化HAL库    
    LED_Init();				//初始化LED	
    EXTI4_Init();			//初始化PA4外部中断，PA4->按键S2
    while(1);
}
//==========================================================
//	函数名称：	EXTI4_IRQHandler()
//
//	函数功能：	中断服务函数
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		EXTI4_IRQHandler 为外部中断4中断处理函数。函数名字不可修改。
//==========================================================
void EXTI4_IRQHandler(void)
{
    static uint8_t state = 0;
    state = 1 - state;
    state?LED2_ON():LED2_OFF();

    __HAL_GPIO_EXTI_CLEAR_IT(S2_PIN);//清除中断
}




