#include "delay.h"
#include "IWDG.h"

//==========================================================
//	函数名称：	Init_Watchdog()
//
//	函数功能：	初始化看门狗
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void Init_Watchdog(void) 
{ 
  WDCTL = 0x00;   //这是必须的，打开IDLE才能设置看门狗
  WDCTL |= 0x08;  //时间间隔一秒，看门狗模式  
}

//==========================================================
//	函数名称：	FeetDog()
//
//	函数功能：	看门狗喂狗
//
//	入口参数：	无
//
//	返回参数：	无
//
//	说明：		
//==========================================================
void FeetDog(void) 
{
  WDCTL = 0xa0; 
  WDCTL = 0x50; 
}
